## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam.aws_iam_role.api_gateway_role[0] will be created
  + resource "aws_iam_role" "api_gateway_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Allows API Gateway to write over CloudWatch"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-petstore-apigateway-logs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "application" = "petstore-demo"
          + "createdby"   = "scaffolding-serverless-project-on-aws"
          + "emails"      = "group@example.com"
          + "environment" = "dev"
          + "nickname"    = "petstore"
        }
      + tags_all              = {
          + "application" = "petstore-demo"
          + "createdby"   = "scaffolding-serverless-project-on-aws"
          + "emails"      = "group@example.com"
          + "environment" = "dev"
          + "nickname"    = "petstore"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for Lambda to execute specific tasks"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-petstore-lambda-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "application" = "petstore-demo"
          + "createdby"   = "scaffolding-serverless-project-on-aws"
          + "emails"      = "group@example.com"
          + "environment" = "dev"
          + "nickname"    = "petstore"
        }
      + tags_all              = {
          + "application" = "petstore-demo"
          + "createdby"   = "scaffolding-serverless-project-on-aws"
          + "emails"      = "group@example.com"
          + "environment" = "dev"
          + "nickname"    = "petstore"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.iam.aws_iam_role_policy.cloudwatch[0] will be created
  + resource "aws_iam_role_policy" "cloudwatch" {
      + id     = (known after apply)
      + name   = "dev-petstore-apigateway-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.iam.aws_iam_role_policy.lambda_policy will be created
  + resource "aws_iam_role_policy" "lambda_policy" {
      + id     = (known after apply)
      + name   = "dev-petstore-lambda-execution-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cognito-idp:ListUsers",
                          + "firehose:PutRecord",
                          + "kms:*",
                          + "ssm:*",
                          + "s3:*",
                          + "ses:SendEmail",
                          + "sns:Publish",
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "ec2:DescribeRegions",
                          + "events:PutEvents",
                          + "lambda:InvokeFunction",
                          + "logs:Describe*",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "logs:PutLogEvents",
                          + "sts:AssumeRole",
                          + "sts:GetCallerIdentity",
                          + "cloudwatch:PutMetricData",
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "CommonActions"
                    },
                  + {
                      + Action   = [
                          + "apigateway:POST",
                          + "apigateway:GET",
                          + "apigateway:DELETE",
                          + "apigateway:PUT",
                          + "apigateway:PATCH",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws-cn:apigateway:*::/apikeys",
                          + "arn:aws-cn:apigateway:*::/apikeys/*",
                          + "arn:aws-cn:apigateway:*::/usageplans/*",
                          + "arn:aws-cn:apigateway:*::/usageplans",
                          + "arn:aws-cn:apigateway:*::/restapis/*/resources",
                        ]
                      + Sid      = "ApiKeyActions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.api_gateway_policy_attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "api_gateway_policy_attachments" {
      + id         = (known after apply)
      + policy_arn = "arn:aws-cn:iam::aws:policy/AWSXrayWriteOnlyAccess"
      + role       = "dev-petstore-apigateway-logs-role"
    }

  # module.iam.aws_iam_role_policy_attachment.api_gateway_policy_attachments[1] will be created
  + resource "aws_iam_role_policy_attachment" "api_gateway_policy_attachments" {
      + id         = (known after apply)
      + policy_arn = "arn:aws-cn:iam::aws:policy/AWSXRayDaemonWriteAccess"
      + role       = "dev-petstore-apigateway-logs-role"
    }

  # module.iam.aws_iam_role_policy_attachment.lambda_policy_attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachments" {
      + id         = (known after apply)
      + policy_arn = "arn:aws-cn:iam::aws:policy/service-role/AWSLambdaENIManagementAccess"
      + role       = "dev-petstore-lambda-execution-role"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_role = {
      + arn = (known after apply)
      + id  = (known after apply)
    }
  + lambda_role      = {
      + arn = (known after apply)
      + id  = (known after apply)
    }
```
</details>